Revit 2024 API
AddInIdAttribute Constructor
Constructs a new AddInIdAttribute.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AddInIdAttribute(
	string addInIdStr
)
Visual Basic
Public Sub New ( _
	addInIdStr As String _
)
Visual C++
public:
AddInIdAttribute(
	String^ addInIdStr
)
Parameters
addInIdStr
Type: System.String
See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace